#include "vector_ru.h"

#introduce(function)
#(Составить программу.)
#(Ввести скаляр max.)
#(Ввести скаляр min.)
#(Введем вектор V из 10 элементов.)
#(Зададим вектор V с клавиатуры.)
#(Найдем минимум вектора V и поместим результат в скаляр min.)
#(Найдем также максимум вектора V и поместим результат в скаляр max.)
#(Вывести вектор V на экран.)
#(Вывести скаляр min на экран.)
#(Вывести скаляр max на экран.)
#(А среднее арифметическое считать не будем.)
#(Тест "1 2 3 4 5 6 7 8 9 10" дает "V[0] = V[1] = V[2] = V[3] = V[4] = V[5] = V[6] = V[7] = V[8] = V[9] = V = [1.000000 2.000000 3.000000 4.000000 5.000000 6.000000 7.000000 8.000000 9.000000 10.000000 ] min = 1.000000 max = 10.000000".)
#stop
